app/views/enrollments/index.html.erb

SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    <tr>
      <td><%= Student.find(enrollment.student.id).student_id %></td>
      <td><%= Course.find(enrollment.course.id).course_id %></td>