app/views/enrollments/new.html.erb

SELECT "students".* FROM "students"
---
	<%= form.label :student_id %>
	<%= form.collection_select :student_id, Student.all, :id, :student_id %>

SELECT "courses".* FROM "courses"
---
	<%= form.label :course_id %>
	<%= form.collection_select :course_id, Course.all, :id, :course_id %>