app/views/enrollments/show.html.erb

SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  <strong>Student ID:</strong>
  <%= Student.find(@enrollment.student.id).student_id %>

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  <strong>Course ID:</strong>
  <%= Course.find(@enrollment.course.id).course_id %>