app/views/courses/show.html.erb

SELECT "enrollments"."id" FROM "enrollments" WHERE "enrollments"."course_id" = $1  [["course_id", 1]]
---

		<% @enrolledStudents = Enrollment.where(course_id:@course) %>