app/controllers/courses_controller.rb

  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save
---
INSERT INTO "courses" ("course_id", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["course_id", "ACMA 210-3 Mathematics of Compound Interest"], ["description", ""], ["created_at", "2017-10-11 04:37:43.647928"], ["updated_at", "2017-10-11 04:37:43.647928"]]

  def update
    respond_to do |format|
      if @course.update(course_params)
---
UPDATE "courses" SET "course_id" = $1, "updated_at" = $2 WHERE "courses"."id" = $3  [["course_id", "ACMA 475"], ["updated_at", "2017-10-11 09:18:45.946497"], ["id", 1]]

  def histogram
    getEnrolledStudents = Enrollment.all
---
SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."student_id" = $1  [["student_id", 222222222]]