app/controllers/courses_controller.rb

  def updateLetterGrades
    @getEnrolledStudents = Enrollment.all
---
SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."student_id" = $1  [["student_id", 222222222]]