app/controllers/enrollments_controller.rb

  def index
    @enrollments = Enrollment.all
---
SELECT "enrollments".* FROM "enrollments"

  def create
    @enrollment = Enrollment.new(enrollment_params)

    respond_to do |format|
      if @enrollment.save
---
INSERT INTO "enrollments" ("student_id", "course_id", "percentage", "lettergrade", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["student_id", 1], ["course_id", 1], ["percentage", 0.0], ["lettergrade", ""], ["created_at", "2017-10-11 08:13:37.422220"], ["updated_at", "2017-10-11 08:13:37.422220"]]

  def update
    respond_to do |format|
      if @enrollment.update(enrollment_params)
---
UPDATE "enrollments" SET "percentage" = $1, "updated_at" = $2 WHERE "enrollments"."id" = $3  [["percentage", 55.0], ["updated_at", "2017-10-14 21:53:40.115342"], ["id", 7]]

  def destroy
    @enrollment.destroy
---
DELETE FROM "enrollments" WHERE "enrollments"."id" = $1  [["id", 3]]

    def set_enrollment
      @enrollment = Enrollment.find(params[:id])
---
SELECT  "enrollments".* FROM "enrollments" WHERE "enrollments"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]