app/controllers/students_controller.rb

INSERT INTO "students" ("student_id", "name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["student_id", 111111111], ["name", "MM"], ["email", "mm@mm.com"], ["created_at", "2017-10-10 10:10:50.069623"], ["updated_at", "2017-10-10 10:10:50.069623"]]
---
  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save